.PHONY: up down

up:
	docker-compose up -d

down:
	docker-compose down

# .PHONYはMakefile内で使用される特殊なターゲットで、実際のファイルと同じ名前のターゲットがある場合でも、依存関係を持たずにターゲットが実行されるように指定するために使われます。

# Makefileでは、ターゲット（ルールの左側にある部分）が通常ファイル名であり、そのファイルが生成されるためのコマンドがルールの右側に記述されます。しかし、upやdownのような抽象的なタスクを実行する場合、実際のファイルを生成するわけではなく、単にコマンドを実行するだけです。そのようなタスクは「phony（偽物）」ターゲットと呼ばれます。

# .PHONYターゲットを使用することで、以下のような利点があります。

# 実際のファイルと同じ名前のターゲットが存在しても、必ず実行されます。
# phony ターゲットは、依存関係がないため、常に実行されます。これにより、make upやmake downのようなコマンドが毎回実行されることを保証します。
